(****************************************************************************** 
  Тесты для решений заданий лабораторной работы №1
 ******************************************************************************)

(****************************************************************************** 
  Загрузка файла с лабораторной работой 
 ******************************************************************************)
use "lab-0.sml";
(****************************************************************************** 
  ТЕСТЫ К РЕШЕНИЯМ
  Здесь приведены по большей части тривиальные тесты. Их успешное выполнение 
  не гарантирует того, что Ваше решение функционирует правильно.
 ******************************************************************************)
(****************************************************************************** 
  Задание 1 double
 ******************************************************************************)
val test1_doubleTest1 = double 0 = 0
val test1_doubleTest2 = double 1 = 2
val test1_doubleTest3 = double ~1 = ~2
val test1_doubleTest4 = double 100 = 200
val test1_doubleTest5 = double ~123 = ~246
(******************************************************************************)

(****************************************************************************** 
  Задание 2 quadruple
 ******************************************************************************)
val test2_quadrupleTest1 = quadruple 0 = 0
val test2_quadrupleTest2 = quadruple ~1 = ~4
val test2_quadrupleTest3 = quadruple 1 = 4
val test2_quadrupleTest4 = quadruple ~20 = ~80
val test2_quadrupleTest5 = quadruple 13 = 52
(******************************************************************************)

(****************************************************************************** 
  Задание 3 sixTimes
 ******************************************************************************)
val test3_sixTimesTest1 = sixTimes 0 = 0
val test3_sixTimesTest2 = sixTimes ~1 = ~6
val test3_sixTimesTest3 = sixTimes 1 = 6
val test3_sixTimesTest4 = sixTimes ~14 = ~84
val test3_sixTimesTest5 = sixTimes 11 = 66
(******************************************************************************)
